hugo/public/lunescript/func/index.html
<!DOCTYPE html>
<html lang="ja">
<head><meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<title>10. 関数 編 - 公開技術情報</title>
<meta name="generator" content="Hugo 0.118.2">
<link href="https://ifritjp.github.io/documentsindex.xml" rel="alternate" type="application/rss+xml">
<link rel="canonical" href="https://ifritjp.github.io/documents/lunescript/func/">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/theme.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/chroma.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/custom.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/highlight_lns.css">
<meta property="og:title" content="10. 関数 編" />
<meta property="og:description" content="今回は、 LuneScript の関数について説明します。 関数定義 LuneScript の関数は次のように定義します。 // @lnsFront: ok fn add_sub( val1:int, val2:int ): int, int { return val1 &#43; val2, val1 - val2; } print( add_sub( 1, 2 ) ); // 3, -1 上記の例" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://ifritjp.github.io/documents/lunescript/func/" /><meta property="article:section" content="LuneScript" />

<meta property="og:site_name" content="公開技術情報" />
<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="10. 関数 編"/>
<meta name="twitter:description" content="今回は、 LuneScript の関数について説明します。 関数定義 LuneScript の関数は次のように定義します。 // @lnsFront: ok fn add_sub( val1:int, val2:int ): int, int { return val1 &#43; val2, val1 - val2; } print( add_sub( 1, 2 ) ); // 3, -1 上記の例"/>
<meta itemprop="name" content="10. 関数 編">
<meta itemprop="description" content="今回は、 LuneScript の関数について説明します。 関数定義 LuneScript の関数は次のように定義します。 // @lnsFront: ok fn add_sub( val1:int, val2:int ): int, int { return val1 &#43; val2, val1 - val2; } print( add_sub( 1, 2 ) ); // 3, -1 上記の例">

<meta itemprop="wordCount" content="1930">
<meta itemprop="keywords" content="" />
</head>
<body><div class="container"><header>
<h1>公開技術情報</h1>


[<a href="https://ifritjp.github.io/documents/en/">English</a>]

[<a href="https://ifritjp.github.io/documents/">Japanese</a>]

</header>
<div class="global-menu">
<nav>
<ul>
<li><a href="/documents/">Home</a></li>
<li><a href="https://ifritjp.github.io/blog2/public/">blog</a></li>
<li><a href="https://ifritjp.github.io/LuneScript-webFront/lnsc_web_frontend/for_wasm/">LuneScript on Web</a></li></ul>
</nav>
</div>
<div class="content-container">
<main><h1>10. 関数 編</h1>

<p>
今回は、 LuneScript の関数について説明します。</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
関数定義
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>LuneScript の関数は次のように定義します。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
fn add_sub( val1:int, val2:int ): int, int {
   return val1 + val2, val1 - val2;
}
print( add_sub( 1, 2 ) ); // 3, -1</code></pre>
</div>
<p>
上記の例は、次の関数を定義しています。</p>
<table>
<thead>
<tr>
<th>定義</th>
<th></th>
<th class="align-right"></th>
</tr>
</thead>
<tbody>
<tr>
<td>関数名</td>
<td>add_sub</td>
<td class="align-right"></td>
</tr>
<tr>
<td>第一引数名</td>
<td>val1</td>
<td class="align-right"></td>
</tr>
<tr>
<td>第一引数型</td>
<td>int</td>
<td class="align-right"></td>
</tr>
<tr>
<td>第二引数名</td>
<td>val2</td>
<td class="align-right"></td>
</tr>
<tr>
<td>第二引数型</td>
<td>int</td>
<td class="align-right"></td>
</tr>
<tr>
<td>第一戻り値型</td>
<td>int</td>
<td class="align-right"></td>
</tr>
<tr>
<td>第二戻り値型</td>
<td>int</td>
<td class="align-right"></td>
</tr>
</tbody>
</table>
<p>
LuneScript は、戻り値を複数返せます。</p>
<div id="outline-container-headline-2" class="outline-4">
<h4 id="headline-2">
戻り値
</h4>
<div id="outline-text-headline-2" class="outline-text-4">
<p>
関数の戻り値は return 文を使用します。</p>
<p>
関数は、複数の値を返せます。</p>
<p>
多値の戻り値については次を参照してください。</p>
<p>
<a href="../multipleretval">../multipleretval</a></p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
処理が戻らない関数
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>
関数によっては、処理を戻さないものがあります。</p>
<p>
次に例を示します。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: error
fn func(): __ {
   while true {
   }
}
func();
print( 1 ); // error</code></pre>
</div>
<p>
この例では、 <code class="verbatim">func()</code> は無限ループです。
よって、 <code class="verbatim">func()</code> は処理を返さないことになります。</p>
<p>
これを明示するため、 <code class="verbatim">func()</code> の戻り値の型は <code>__</code> となっています。
<code>__</code> は、処理を戻さない関数であることを示します。</p>
<p>
これによって、 <code class="verbatim">func()</code> の次の <code class="verbatim">print()</code> 文が処理されないことが分かり、
エラーとなります。</p>
<p>
なお、 戻り値型を <code>__</code> とした関数は、
処理を戻さないようにしなければなりません。</p>
<p>
例えば次のように break すると、ループを抜けてしまうため、
<code class="verbatim">func()</code> から処理が戻ってきます。
このような場合は、エラーとなります。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: error
fn func(val:int): __ {
   while true {
      if val == 1 {
         break;
      }
   }
}</code></pre>
</div>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
可変長引数、戻り値
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>
可変長引数、戻り値を利用できます。</p>
<p>
詳細は次の記事を参照してください。</p>
<p>
<a href="../arg">../arg</a></p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
定義場所
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>
関数は、 statement が書ける場所であればどこでも定義可能です。
具体的には次のようにブロック内に定義できます。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
fn sub():int {
   let mut val = 0;
   {
      {
         fn func(): int {
            return 1;
         }
         val = val + func();
      }
      fn func(): int {
         return 2;
      }
      val = val + func();
   }
   fn func(): int {
      return 3;
   }
   return val + func();
}
print( sub() ); // 6</code></pre>
</div>
<p>
スコープが異なれば、同名関数を定義できます。</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
公開関数
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>
関数も変数と同様、pub を使って外部公開できます。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
pub fn func(): int {
   return 1;
}</code></pre>
</div>
<p>
pub を指定することで、外部からアクセス可能な関数となります。</p>
<p>
global も利用できます。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
global fn func(): int {
   return 1;
}</code></pre>
</div>
<p>
関数の global 宣言には、 変数の global 宣言と同じ制約があります。</p>
<p>
 <strong>「global 宣言した関数は、 その関数を宣言したモジュールを import した時に有効になる。」</strong></p>
<p>
関数の外部公開には、次の制約があります。</p>
<p>
 <strong>「外部公開する関数は、スクリプトの最上位のスコープに宣言しなければならない」</strong></p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
form 型
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>
LuneScript は、関数オブジェクトを値として扱うことが出来ます。
特殊な関数オブジェクトの型として <strong>form</strong> を利用できます。</p>
<p>
次に form の使用例を示します。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
fn test() {
   print( &#34;hoge&#34; );
}
fn sub( func:form ) {
  func();
}
sub( test ); // hoge</code></pre>
</div>
<p>
この例は、次の構成となります。</p>
<ul>
<li>関数 test を定義</li>
<li>関数 sub は form 型の引数を持つ</li>
<li>引数として test を指定して sub を実行</li>
</ul>
<p>これによって、 sub 内で test が実行され、 hoge が出力されます。</p>
<p>
なお、 form 型は次の関数として扱います。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: skip
fn func(...):... {}</code></pre>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
form 型に代入可能な関数型
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>
上記の通り、form は <code>fn func(...):... {}</code> と同義です。</p>
<p>
また、 <code class="verbatim">...</code> は 0 個以上の <code class="verbatim">stem!</code> を表わします。</p>
<p>
つまり、 stem! 型の引数を持つ関数が form 型に代入可能になり、
非 stem! 型の引数を持つ関数は代入不可能になります。</p>
<p>
もしも代入できてしまうと、
次の func2( nil ) のコールは func( nil ) をコールすることになり、
不正動作となってしまいます。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: error
fn func( val:int ) {
   print( val + 1 );
}
let func2:form = func;
func2( nil );</code></pre>
</div>
<p>
代入可能なケースと、代入不可能なケースの例を次に示します。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: error
let form1:form = fn ( val1:stem! ) { };
let form2:form = fn ( val1:stem ) { };  // error
let form3:form = fn ( val1:stem!, val2:stem! ) { };
let form4:form = fn ( val1:stem!, val2:stem ) { }; // error</code></pre>
</div>
<p>
上記の form1, form3 は代入可能で、form2, form4 は代入不可能です。</p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
form 宣言
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>
上記の通り、form で扱える関数の型は一部だけです。</p>
<p>
form で扱えない関数を扱うには、次のように form 宣言をします。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
form funcform( val:int ):int;
fn sub( func:funcform ) {
   print( func( 1 ) + 1 );
}
sub( fn ( val:int ):int { return val + 1; } ); // 3</code></pre>
</div>
<p>
この例では、 funcform を form 宣言しています。</p>
<p>
form 宣言によって funcform は、引数に int 型の val を持ち、
戻り値に int 型を持つ関数型となります。</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
anonymous 関数
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>
anonymous 関数は、名前を持たない関数を定義します。</p>
<p>
次は anonymous 関数の例です。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
fn sub( func:form ) {
  func( 1 );
}
sub( fn ( val:stem! ) { print( val ); } );  // 1</code></pre>
</div>
<p>
この例では、 anonymous 関数 <code>fn ( val:int ) { print( val ); }</code> を定義しています。</p>
<p>
この anonymous 関数を <code class="verbatim">sub()</code> の引数に渡すことで、
<code class="verbatim">sub()</code> 内で anonymous 関数が実行されます。</p>
<p>
anonymous 関数宣言は式です。</p>
</div>
</div>
<div id="outline-container-headline-11" class="outline-2">
<h2 id="headline-11">
関数呼び出し
</h2>
<div id="outline-text-headline-11" class="outline-text-2">
<p>
関数オブジェクトに <code>()</code> を付けることで、その関数が実行されます。</p>
<p>
関数の仮引数と実引数の型は一致しなければなりません。
なお、省略した実引数は nil として扱います。
もし省略した実引数に対応する仮引数が nilable でなかった場合、エラーとなります。</p>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
引数の省略  
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>
引数の省略については次の記事を確認してください。</p>
<p>
<a href="../defaultarg">../defaultarg</a></p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-13" class="outline-2">
<h2 id="headline-13">
関数の制限
</h2>
<div id="outline-text-headline-13" class="outline-text-2">
<p>
LuneScript の関数は、引数の違いによるオーバーロードはできません。</p>
</div>
</div>
<div id="outline-container-headline-14" class="outline-2">
<h2 id="headline-14">
まとめ
</h2>
<div id="outline-text-headline-14" class="outline-text-2">
<p>
LuneScript の関数をまとめると、</p>
<ul>
<li>fn で宣言する</li>
<li>複数の戻り値を持てる</li>
<li>可変長の引数、戻り値をもてる</li>
<li>pub, global で外部モジュールに関数を公開する</li>
<li>関数オブジェクトの型は、form 型と form 宣言を使用する</li>
<li>anonymous 関数がある</li>
<li>省略した実引数には nil が入る</li>
<li>関数オーバーロードはない</li>
</ul>
<p>次回は nilable について説明します。</p>
</div>
</div>
<div class="edit-meta">

<br></div><nav class="pagination"><a class="nav nav-prev-2" href="https://ifritjp.github.io/documents/lunescript/loop/" title="09. 繰り返し構文 編"><i class="fas fa-arrow-left" aria-hidden="true"></i> Prev - 09. 繰り返し構文 編</a>
<a class="nav nav-next-2" href="https://ifritjp.github.io/documents/lunescript/multipleretval/" title="10.2. 多値の戻り値">Next - 10.2. 多値の戻り値 <i class="fas fa-arrow-right" aria-hidden="true"></i></a>
</nav><footer><p class="powered">Powered by <a href="https://gohugo.io">Hugo</a>. Theme by <a href="https://themes.gohugo.io/hugo-theme-techdoc/">TechDoc</a>. Designed by <a href="https://github.com/thingsym/hugo-theme-techdoc">Thingsym</a>.</p>
</footer>
</main><div class="sidebar">

<nav class="slide-menu">
<ul>
<li class=""><a href="https://ifritjp.github.io/documents">Home</a></li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lctags/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lctags/introduce/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/rename/">C/C&#43;&#43; ソースコードをリファクタリング by lctags on emacs (リネーム編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/enum/">C/C&#43;&#43; の enum 補完 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/highlight/">C/C&#43;&#43; の特定シンボルをハイライト by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/varsize/">C/C&#43;&#43; の変数サイズ確認 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callgraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなコールグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/modulegraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなモジュール構成図っぽいグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callfunc/">lctags で C 言語の関数コールを簡単に</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/register/">lctags のプロジェクト簡易登録</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/c-language/">lctags を開発している時に改めて感じた C 言語規格のイケてないところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/subroutine/">lctags を使って C/C&#43;&#43; ソースコードをリファクタリング(サブルーチン化編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/windows/">Windows で lctags (C言語/C&#43;&#43; のタグジャンプ、コールグラフ、etc..)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lua/">C/C&#43;&#43; 言語プログラマのための Lua 入門リファレンス<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lua/detail/">C インタフェース詳細編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/interface/">C インタフェース編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/fengari/">fengari の使い方 (Lua を Web ブラウザで動かす方法)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/lua5.4/">Lua 5.4 の主な変更点</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/anti-pattern/">Lua でやりがちなミス</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/pointer/">ポインタ編</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/emacs/">Emacs<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/emacs/simple-httpd/">emacs 簡易 HTTPD 化パケージ simple-httpd.el</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/emacs/company-mode/">自作言語 (LuneScript) の emacs company-mode backend 設定</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/go/">Goes<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/go/package/">Go のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/go/guide/">Go 入門</a></li>
</ul>
  
</li>

<li class=""><a href="https://ifritjp.github.io/documents/gcp/">Google Cloud Platform を使ってみる</a>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/javascript/">Javascripts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/javascript/d3force/">D3.js V4 forceSimulation のノード動的更新(追加・削除)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/javascript/thread/">JavaScript のスレッド(非同期処理)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/libclang/">Lua で C/C&#43;&#43; の構文解析 (libclang の Lua binding)<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/libclang/operator/">libclang で演算子を特定する方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/libclang/ast/">libclang の AST(Abstract Syntax Tree)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/objective-c/">Objective-C<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/objective-c/arc/">Objective-C  の MRC と ARC と オートリリースプール</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/rust/">Rusts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/rust/lifetime/">C/C&#43;&#43;エンジニアのための Rust のデータ所有権とライフタイム入門</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/singleboard/">Singleboards<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/raspios64-point/">64bit 版 Raspberry Pi OS でカーネルモジュールを使った際に遭遇したエラーと対応方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/build-kernel-module-64/">64bit 版 Raspberry Pi OS のカーネルモジュールのビルド環境設定</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/bluetooth-a2dp-receiver/">Raspberry Pi で Bluetooth レシーバー (オーディオ:A2DP) を作成するための設定方法解説</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/usb-gadget/">USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/recover-image/">誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処</a></li>
</ul>
  
</li>

<li class="parent has-sub-menu"><a href="https://ifritjp.github.io/documents/lunescript/">トランスコンパイラ LuneScript で Lua の開発をもっと楽に!!<span class="mark opened">-</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial1/">00. はじめに</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial2.setup/">01. 導入編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial3.hello/">02. Hello world</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/crosscompile/">03. Lua バージョン間のクロスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/value/">04. 値編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/set/">04.2. Set 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tuple/">04.3 タプル編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/enum/">05. enum 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/match/">06. match 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/variable/">07. 変数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/branch/">08. 一般分岐構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/loop/">09. 繰り返し構文 編</a></li>
<li class="active"><a href="https://ifritjp.github.io/documents/lunescript/func/">10. 関数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/multipleretval/">10.2. 多値の戻り値</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/defaultarg/">10.3. 引数の省略 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/arg/">10.4. 可変長引数、戻り値 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/closure/">10.5. クロージャ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/error/">10.6. エラーハンドリング編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilable/">11. nilable 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class1/">12. クラス 基本 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class2accessor/">13. accessor 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classinherit/">14. クラス 継承 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classadvertise/">15. クラス advertise 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classoverride/">16. クラス override 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/interface/">17. インタフェース 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classmapping/">18. mapping 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/generics/">19. generics 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/generics-go/">19.2. generics (2つの collection 型) 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilcond/">20. nil 条件演算子 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/import/">21. import/provide 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/require/">22. require/module 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/glue/">22.1. glue コードの半自動生成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua/">22.2. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/make/">23. ビルド 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/macro/">24. マクロ 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/cast/">25. キャスト 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/subfile/">26. subfile 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lazyloading/">27. 遅延ロード 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/shebang_main/">28. shebang とコマンドライン引数</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/dir/">29. LuneScript を利用するプロジェクトの推奨ディレクトリ構成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go/">80. Go 言語へのトランスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_package/">80.2 Go 言語へのトランスコンパイル時のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua_runtime/">80.3 Go へトランスコンパイルした際の Lua ランタイム</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_wasm/">80.4 LuneScript の WebAssembly 対応</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async/">81. 安全な非同期処理</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async_old/">81.1 非同期処理(過去情報)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/luago/">82. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/ebnf/">A. BNF</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lnstags/">A. lnstags によるタグジャンプ (ソースコードタグシステム)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/reason/">A. Lua のトランスコンパイラ LuneScript を開発した理由</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/regret/">A. LuneScript の言語仕様でミスだったと思っているところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/onweb/">A. Web ブラウザ上で動作する LuneScript</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/recommend/">A. トランスコンパイラ開発のすゝめ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/completion/">A.イマドキな開発環境でもっと楽しよう</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/box/">Box 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/test/">X. 言語開発の品質コントロールにおけるセルフホスティングの重要性とテスト設計</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design/">Y.1 LuneScript の開発方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design-2/">Y.2 LuneScript の開発(型情報管理)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design-3/">Y.3 LuneScript の開発(スコープとシンボル)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_study/">Z. Go 言語へのトランスコンパイル (検討段階)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/all/">全文検索用結合ファイル</a></li>
</ul>
  
</li>

<li class=""><a href="https://ifritjp.github.io/documents/misc/">細かいメモ</a>
  
</li>
</ul>
</nav>



<div class="sidebar-footer"></div>
</div>
</div><a href="#" id="backtothetop-fixed" class="backtothetop"
 data-backtothetop-duration="600"
 data-backtothetop-easing="easeOutQuart"
 data-backtothetop-fixed-fadeIn="1000"
 data-backtothetop-fixed-fadeOut="1000"
 data-backtothetop-fixed-bottom="10"
 data-backtothetop-fixed-right="20">
<span class="fa-layers fa-fw">
<i class="fas fa-circle"></i>
<i class="fas fa-arrow-circle-up"></i>
</span></a>
</div>
</body>
</html>
